antongus/stm32tpl/CMSIS/mm32f031x6.h
/**
  * @file   mm32f031x6.h
  */
                                                           
/** @addtogroup mm32f031x6
  * @{
  */
    
#ifndef __MM32F031x6_H
#define __MM32F031x6_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/**
 * @brief Configuration of the Cortex-M0 Processor and Core Peripherals
 */
#define __CM0_REV                 0   /*!< Core Revision r0p0                            */
#define __MPU_PRESENT             0   /*!< MM32F0xx do not provide MPU                  */
#define __NVIC_PRIO_BITS          2   /*!< MM32F0xx uses 2 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0   /*!< Set to 1 if different SysTick Config is used */
 
/**
 * @brief MM32F0xx Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section 
 */

 /*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M0 Processor Exceptions Numbers **************************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                        */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M0 Hard Fault Interrupt                                */
  SVC_IRQn                    = -5,     /*!< 11 Cortex-M0 SV Call Interrupt                                  */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0 Pend SV Interrupt                                  */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M0 System Tick Interrupt                              */

/******  STM32F0 specific Interrupt Numbers ******************************************************************/
  WWDG_IRQn                   = 0,      /*!< Window WatchDog Interrupt                               */
  PVD_IRQn                    = 1,      /*!< PVD Interrupt through EXTI Lines 16                             */
  FLASH_IRQn                  = 3,      /*!< FLASH global Interrupt                                          */
  RCC_IRQn                    = 4,      /*!< RCC global Interrupt                                            */
  EXTI0_1_IRQn                = 5,      /*!< EXTI Line 0 and 1 Interrupt                                     */
  EXTI2_3_IRQn                = 6,      /*!< EXTI Line 2 and 3 Interrupt                                     */
  EXTI4_15_IRQn               = 7,      /*!< EXTI Line 4 to 15 Interrupt                                     */
  DMA1_Channel1_IRQn          = 9,      /*!< DMA1 Channel 1 Interrupt                                        */
  DMA1_Channel2_3_IRQn        = 10,     /*!< DMA1 Channel 2 and Channel 3 Interrupt                          */
  DMA1_Channel4_5_IRQn        = 11,     /*!< DMA1 Channel 4 and Channel 5 Interrupt                          */
  ADC1_IRQn                   = 12,     /*!< ADC1 Interrupt                                                  */
  TIM1_BRK_UP_TRG_COM_IRQn    = 13,     /*!< TIM1 Break, Update, Trigger and Commutation Interrupt           */
  TIM1_CC_IRQn                = 14,     /*!< TIM1 Capture Compare Interrupt                                  */
  TIM2_IRQn                   = 15,     /*!< TIM2 global Interrupt                                           */
  TIM3_IRQn                   = 16,     /*!< TIM3 global Interrupt                                           */
  TIM14_IRQn                  = 19,     /*!< TIM14 global Interrupt                                          */
  TIM16_IRQn                  = 21,     /*!< TIM16 global Interrupt                                          */
  TIM17_IRQn                  = 22,     /*!< TIM17 global Interrupt                                          */
  I2C1_IRQn                   = 23,     /*!< I2C1 Event Interrupt & EXTI Line23 Interrupt (I2C1 wakeup)      */
  SPI1_IRQn                   = 25,     /*!< SPI1 global Interrupt                                           */
  USART1_IRQn                 = 27      /*!< USART1 global Interrupt & EXTI Line25 Interrupt (USART1 wakeup) */
} IRQn_Type;

/**
  * @}
  */

#include "core_cm0.h"            /* Cortex-M0 processor and core peripherals */
#include <stdint.h>

/** 
  * @brief FLASH Registers
  */
typedef struct
{
	volatile uint32_t ACR;          //!<FLASH access control register
	volatile uint32_t KEYR;         //!<FLASH key register
	volatile uint32_t OPTKEYR;      //!<FLASH OPT key register
	volatile uint32_t SR;           //!<FLASH status register
	volatile uint32_t CR;           //!<FLASH control register
	volatile uint32_t AR;           //!<FLASH address register
	volatile uint32_t RESERVED;     //!< Reserved
	volatile uint32_t OBR;          //!<FLASH option bytes register
	volatile uint32_t WRPR;         //!<FLASH option bytes register
} FLASH_TypeDef;

/** 
  * @brief Reset and Clock Control
  */
typedef struct
{
	volatile uint32_t CR;            /*!< RCC clock control register,                                   Address offset: 0x00 */
	volatile uint32_t CFGR;       /*!< RCC clock configuration register,                            Address offset: 0x04 */
	volatile uint32_t CIR;        /*!< RCC clock interrupt register,                                Address offset: 0x08 */
	volatile uint32_t APB2RSTR;   /*!< RCC APB2 peripheral reset register,                          Address offset: 0x0C */
	volatile uint32_t APB1RSTR;   /*!< RCC APB1 peripheral reset register,                          Address offset: 0x10 */
	volatile uint32_t AHBENR;     /*!< RCC AHB peripheral clock register,                           Address offset: 0x14 */
	volatile uint32_t APB2ENR;    /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 */
	volatile uint32_t APB1ENR;    /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C */
	volatile uint32_t BDCR;       /*!< RCC Backup domain control register,                          Address offset: 0x20 */
	volatile uint32_t CSR;        /*!< RCC clock control & status register,                         Address offset: 0x24 */
	volatile uint32_t AHBRSTR;    /*!< RCC AHB peripheral reset register,                           Address offset: 0x28 */
	volatile uint32_t CFGR2;      /*!< RCC clock configuration register 2,                          Address offset: 0x2C */
	volatile uint32_t CFGR3;      /*!< RCC clock configuration register 3,                          Address offset: 0x30 */
	volatile uint32_t CR2;        /*!< RCC clock control register 2,                                Address offset: 0x34 */
} RCC_TypeDef;

/**
  * @brief SysTem Configuration
  */

typedef struct
{
	volatile uint32_t CFGR1;       //!< SYSCFG configuration register
	         uint32_t RESERVED;    //!< Reserved
	volatile uint32_t EXTICR[4];   //!< SYSCFG external interrupt configuration register
} SYSCFG_TypeDef;

/**
  * @brief Power Control
  */
typedef struct
{
	volatile uint32_t CR;   //!< PWR power control register
	volatile uint32_t CSR;  //!< PWR power control/status register
} PWR_TypeDef;

#define FLASH_BASE            ((uint32_t)0x08000000U)              /*!< FLASH base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000U)              /*!< SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000U)              /*!< Peripheral base address in the alias region */

/*!< Peripheral memory map */
#define APBPERIPH_BASE        PERIPH_BASE
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000)

